{"text": "Australia and the U.K. are two of America’s most stalwart Allies.\n\nPresident Biden is committed to working with Prime Minister Albanese and Prime Minister Sunak to ensure security and prosperity for decades to come. https://t.co/iZnkdyaKS6", "user": "WhiteHouse", "id": 1635460661332393987, "created_at": "2023-03-14 01:59:41+00:00"}
{"text": "Access to affordable, high-quality child care helps children learn, gives parents breathing room, and helps more parents work.\n\nPresident Biden’s budget will cut child care costs for millions of families. https://t.co/BZydIBR7rb", "user": "WhiteHouse", "id": 1635438101467111425, "created_at": "2023-03-14 00:30:03+00:00"}
{"text": "Today, @POTUS, @AlboMP, and @RishiSunak announced steps to carry forward the Australia – U.K. – U.S. Partnership.\n\nDeveloping Australia’s conventionally-armed, nuclear-powered submarine capacity and our own will enhance stability in the Indo-Pacific. https://t.co/nZzWt5SbQq", "user": "WhiteHouse", "id": 1635423003835088897, "created_at": "2023-03-13 23:30:03+00:00"}
{"text": "Working people power our economy. When they thrive, our economy thrives.\n\nPresident Biden’s budget proposes to establish a national, comprehensive paid family and medical leave and calls for paid sick leave for all workers.", "user": "WhiteHouse", "id": 1635409049310117889, "created_at": "2023-03-13 22:34:36+00:00"}
{"text": "Happening Now: President Biden delivers remarks on the Australia-United Kingdom-United States Partnership. https://t.co/i5GzAi4deE", "user": "WhiteHouse", "id": 1635380621399805952, "created_at": "2023-03-13 20:41:38+00:00"}
{"text": "Two very different plans. https://t.co/102cnQWnKx", "user": "WhiteHouse", "id": 1635370173874991121, "created_at": "2023-03-13 20:00:07+00:00"}
{"text": "The previous Administration rolled back tough requirements on banks.\n\nPresident Biden will ask Congress and banking regulators to strengthen the rules for banks to make it less likely that a bank failure like Silicon Valley Bank and Signature Bank happens again.", "user": "WhiteHouse", "id": 1635339945245298688, "created_at": "2023-03-13 18:00:00+00:00"}
{"text": "Today, President Biden highlighted actions this Administration is taking to address problems at Silicon Valley Bank and Signature Bank.\n\nAmericans can have confidence that our banking system is safe and taxpayer dollars will not be put at risk. https://t.co/9PIFlkmOYi", "user": "WhiteHouse", "id": 1635324861873627148, "created_at": "2023-03-13 17:00:04+00:00"}
{"text": "Generations of Americans have counted on Medicare and Social Security to be able to retire with dignity and security.\n\nPresident Biden’s budget will protect and strengthen these programs without cutting a single benefit. https://t.co/ta7hyH7tC7", "user": "WhiteHouse", "id": 1635305428094713856, "created_at": "2023-03-13 15:42:51+00:00"}
{"text": "Cable, internet, and cell phone companies can charge you over $200 if you decide to switch to another provider. \n\nPresident Biden continues to call on Congress to pass the Junk Fee Prevention Act to eliminate these excessive fees so companies can no longer lock in consumers. https://t.co/Hn9HMDACzN", "user": "WhiteHouse", "id": 1635098431508328451, "created_at": "2023-03-13 02:00:19+00:00"}
{"text": "This Administration took action to reduce exorbitant bank fees by pushing banks to end bounced check fees and moving to ban surprise overdraft fees – saving consumers more than $5 billion a year compared to pre-pandemic.", "user": "WhiteHouse", "id": 1635090682816675842, "created_at": "2023-03-13 01:29:31+00:00"}
{"text": "This week, @VP:\n- Spoke in Colorado and at @aspenideas about tackling climate change\n- Met with former Liberian President Ellen Johnson Sirleaf\n- Hosted a Worker Task Force roundtable https://t.co/KYJArpDgqr", "user": "WhiteHouse", "id": 1635022868080738306, "created_at": "2023-03-12 21:00:03+00:00"}
{"text": "President Biden’s budget restores the full Child Tax Credit – which cut child poverty in half in 2021, to the lowest level in history.", "user": "WhiteHouse", "id": 1635007754095190016, "created_at": "2023-03-12 20:00:00+00:00"}
{"text": "By making the wealthy pay their fair share and cutting wasteful spending on special interests, President Biden’s budget will cut the deficit by nearly $3 trillion over the next decade. https://t.co/MAFZNcTb8m", "user": "WhiteHouse", "id": 1634992660162199556, "created_at": "2023-03-12 19:00:01+00:00"}
{"text": "On International Women’s Day, the First Lady hosted the International Women of Courage Award for the first time at the White House. These courageous women are pursuing justice, freedom, and peace around the world. https://t.co/LnE5PUbXAD", "user": "WhiteHouse", "id": 1634962478122651650, "created_at": "2023-03-12 17:00:05+00:00"}
{"text": "Our economy is moving in the right direction under President Biden’s leadership. https://t.co/n4vtZB4RaM", "user": "WhiteHouse", "id": 1634947370323410945, "created_at": "2023-03-12 16:00:03+00:00"}
{"text": "23,000 infrastructure projects and awards across 4,500 cities and towns have already been announced under President Biden’s Bipartisan Infrastructure Law – rebuilding America’s roads and bridges, strengthening ports and airports, and making coastal communities more resilient. https://t.co/mNgxvcsqvX", "user": "WhiteHouse", "id": 1634930801266634753, "created_at": "2023-03-12 14:54:13+00:00"}
{"text": "President Biden has long believed we need to grow the economy from the bottom up and middle out.\n\nHis budget will continue this strategy by investing in America, lowering costs for families, protecting and strengthening Social Security and Medicare, and reducing the deficit. https://t.co/xcfEVuUAw9", "user": "WhiteHouse", "id": 1634735970296758274, "created_at": "2023-03-12 02:00:01+00:00"}
{"text": "A week defined by progress. https://t.co/teanGcSdNS", "user": "WhiteHouse", "id": 1634705792589864961, "created_at": "2023-03-12 00:00:06+00:00"}
{"text": "The Biden-Harris Administration stands with women and girls around the world as we work to advance gender equity and equality. https://t.co/0JPRVmdfrO", "user": "WhiteHouse", "id": 1634660474749845506, "created_at": "2023-03-11 21:00:02+00:00"}
{"text": "For the eight million Americans – like Ryan – who were able to stay in their homes without sacrificing other basic needs under Emergency Rental Assistance, President Biden’s American Rescue Plan was lifechanging. https://t.co/4m02KdRLLB", "user": "WhiteHouse", "id": 1634608472753946624, "created_at": "2023-03-11 17:33:24+00:00"}
{"text": "Two years ago, with a pandemic raging and an economy reeling, President Biden signed the American Rescue Plan.\n\nToday, it’s led to the fastest economic recovery in the world, drove the strongest two years of job growth ever, put money in family’s pockets, and more.", "user": "WhiteHouse", "id": 1634608333716897792, "created_at": "2023-03-11 17:32:50+00:00"}
{"text": "This week, @POTUS laid out a budget that invests in America, lowers costs for families, protects Medicare and Social Security, and reduces the deficit.\n\nMAGA House Republicans released a proposal that would give tax breaks to the rich, cut Medicare, and ship jobs overseas.", "user": "WhiteHouse", "id": 1634569870435074049, "created_at": "2023-03-11 15:00:00+00:00"}
{"text": "During President Biden’s first two years in office, he has achieved record-breaking deficit reduction – with the deficit coming down by $1.7 trillion.\n\nHis budget will build on this progress, bringing down the deficit by an additional $3 trillion over 10 years.", "user": "WhiteHouse", "id": 1634403775870906370, "created_at": "2023-03-11 04:00:00+00:00"}
{"text": "President Biden's economic plan has unleashed over $300 billion in private sector investments in manufacturing – ensuring the supply chain for America begins in America. https://t.co/UQzINGtWEA", "user": "WhiteHouse", "id": 1634373583198642178, "created_at": "2023-03-11 02:00:02+00:00"}
{"text": "President Biden’s budget expands access to free, high-quality preschool – making it available to all of the approximately four million four-year-old children in the United States.", "user": "WhiteHouse", "id": 1634358476477550592, "created_at": "2023-03-11 01:00:00+00:00"}
{"text": "President Biden’s budget will build on the progress we’ve already made giving families more breathing room by further lowering everyday costs – including for health insurance, prescription drugs, higher education, child care, utilities, and more. https://t.co/UvS4lqMrCI", "user": "WhiteHouse", "id": 1634343379772342272, "created_at": "2023-03-11 00:00:01+00:00"}
{"text": "While MAGA Congressional Republicans threaten to cut Medicare and Social Security, President Biden’s budget strengthens these bedrock programs that seniors have paid into their entire working lives.", "user": "WhiteHouse", "id": 1634328277551595522, "created_at": "2023-03-10 23:00:00+00:00"}
{"text": "More than 500 anti-LGBTQI+ bills have been introduced at the state level so far this year.\n\nIn the face of this record number of anti-LGBTQI+ bills, this Administration reaffirms its commitment to fighting for the safety and dignity of the LGBTQI+ community. We have your back.", "user": "WhiteHouse", "id": 1634324355273437186, "created_at": "2023-03-10 22:44:25+00:00"}
{"text": "President Biden’s economic plan is working. https://t.co/uNFLktP8gF", "user": "WhiteHouse", "id": 1634313182356357122, "created_at": "2023-03-10 22:00:01+00:00"}
{"text": "To mark Women’s History Month and Purim, the White House hosted its first-ever Jewish Women’s Forum. More than 70 Jewish women leaders met with @SecondGentleman and Biden-Harris Administration officials to discuss gender equity, combating antisemitism, and civic engagement. https://t.co/qD0eajFsHl", "user": "WhiteHouse", "id": 1634294425059721216, "created_at": "2023-03-10 20:45:29+00:00"}
{"text": "Tune in for a briefing with Press Secretary Karine Jean-Pierre. https://t.co/Z5yuqJ5fjC", "user": "WhiteHouse", "id": 1634279190726955035, "created_at": "2023-03-10 19:44:57+00:00"}
{"text": "President Biden’s economic plan continues to deliver for working Americans. https://t.co/t9m7UnBJHf", "user": "WhiteHouse", "id": 1634250269272711177, "created_at": "2023-03-10 17:50:01+00:00"}
{"text": "Our economy added 311,000 jobs in February.\n\nThat’s over 12.4 million jobs created under President Biden.", "user": "WhiteHouse", "id": 1634229509363847168, "created_at": "2023-03-10 16:27:32+00:00"}
{"text": "Happening Now: President Biden delivers remarks on the February jobs report and our transition to steady, stable economic growth. https://t.co/JFmAFSdlbL", "user": "WhiteHouse", "id": 1634224870811742215, "created_at": "2023-03-10 16:09:06+00:00"}
{"text": "President Biden’s budget expands access to free, high-equality preschool – making it available to all of the approximately four million four-year-old children in the United States. https://t.co/cWX7xLpLCu", "user": "WhiteHouse", "id": 1634041397094301696, "created_at": "2023-03-10 04:00:02+00:00"}
{"text": "The difference in plans between President Biden and Congressional Republicans couldn’t be clearer. https://t.co/zDHHRlLGYh", "user": "WhiteHouse", "id": 1634026315694178305, "created_at": "2023-03-10 03:00:07+00:00"}
{"text": "President Biden’s budget calls for capping the cost of insulin at $35 a month for everyone – especially for the roughly 200,000 children with Type 1 diabetes.", "user": "WhiteHouse", "id": 1634011188165058561, "created_at": "2023-03-10 02:00:00+00:00"}
{"text": "President Biden has laid out his budget.\n\nRepublicans in Congress should do the same. https://t.co/Liy1r0bzDY", "user": "WhiteHouse", "id": 1633965912259964928, "created_at": "2023-03-09 23:00:05+00:00"}
{"text": "Here’s how President Biden’s budget will continue our work to grow the economy from the bottom up and the middle out – not the top down.\n\nhttps://t.co/fjDcj4092E https://t.co/lpSZYnzgtx", "user": "WhiteHouse", "id": 1633950988380897280, "created_at": "2023-03-09 22:00:47+00:00"}
{"text": "No one earning less than $400,000 per year will see their taxes go up by one penny under President Biden’s budget.", "user": "WhiteHouse", "id": 1633935693264084993, "created_at": "2023-03-09 21:00:00+00:00"}
{"text": "President Biden’s budget will extend Medicare’s solvency through 2050 – without cutting a single benefit or raising taxes on anyone earning less than $400,000 a year. https://t.co/5hNNh5NhS9", "user": "WhiteHouse", "id": 1633923523864571905, "created_at": "2023-03-09 20:11:39+00:00"}
{"text": "Happening Now: President Biden walks through his 2024 budget for a bottom-up, middle-out economy. https://t.co/QR0cDMON1n", "user": "WhiteHouse", "id": 1633909105650745375, "created_at": "2023-03-09 19:14:22+00:00"}
{"text": "The work this Administration has done to bring down costs is making a real difference in people’s lives.\n\nPresident Biden’s budget will continue this progress to help families breathe a little easier.", "user": "WhiteHouse", "id": 1633905556967571485, "created_at": "2023-03-09 19:00:15+00:00"}
{"text": "There’s nothing more important than making sure every child in America has the nutrition they need to thrive.\n\nPresident Biden’s budget will increase food security for families. https://t.co/5xiGPXKlsF", "user": "WhiteHouse", "id": 1633905552643244046, "created_at": "2023-03-09 19:00:14+00:00"}
{"text": "President Biden’s budget will continue to modernize America’s ports and waterways – ensuring that goods move quickly and smoothly to the American people. https://t.co/HVl2XL0wYP", "user": "WhiteHouse", "id": 1633905547761074208, "created_at": "2023-03-09 19:00:13+00:00"}
{"text": "By expanding free community college and increasing Pell Grants, President Biden’s budget will expand access to an affordable college education for millions of Americans. https://t.co/FgLiXZT4Lw", "user": "WhiteHouse", "id": 1633905541813551125, "created_at": "2023-03-09 19:00:12+00:00"}
{"text": "President Biden’s budget invests in increasing the supply of affordable housing, lowering rental costs, and making it easier to buy a home. https://t.co/nTUtWgK7ye", "user": "WhiteHouse", "id": 1633905536943964160, "created_at": "2023-03-09 19:00:11+00:00"}
{"text": "When families can access early education, children are set up for long-term success and money stays in parents’ pockets.\n\nPresident Biden’s budget provides funding for free, high-quality, universal preschool for millions of children. https://t.co/I9FemqANgK", "user": "WhiteHouse", "id": 1633905530124025866, "created_at": "2023-03-09 19:00:09+00:00"}
{"text": "To support working parents and grow the economy, President Biden’s budget expands access to affordable, high-quality child care for millions of families. https://t.co/igfhvkTJc7", "user": "WhiteHouse", "id": 1633905521206935571, "created_at": "2023-03-09 19:00:07+00:00"}
{"text": "President Biden believes health care should be a right, not a privilege.\n\nHis budget will continue to lower health care costs by making lower Affordable Care Act premiums permanent, capping the cost of insulin at $35 a month for every American, and more. https://t.co/YRlvJivLol", "user": "WhiteHouse", "id": 1633905512747024411, "created_at": "2023-03-09 19:00:05+00:00"}
{"text": "President Biden is laser-focused on lowering costs for families – on everything from health care to child care.\n\nHere’s how his budget will give you more breathing room: https://t.co/9jIW4GpZM1", "user": "WhiteHouse", "id": 1633905501648896002, "created_at": "2023-03-09 19:00:02+00:00"}
{"text": "Under President Biden’s leadership, we’ve made historic progress in growing the economy from the bottom up and the middle out – not the top down.\n\nToday, he is releasing a budget to build on that progress.\n https://t.co/fjDcj4092E", "user": "WhiteHouse", "id": 1633884857439797249, "created_at": "2023-03-09 17:38:00+00:00"}
{"text": "President Biden’s budget will cut the deficit by nearly $3 trillion over 10 years by cutting wasteful spending on special interests and ensuring the wealthy and large corporations pay their fair share.", "user": "WhiteHouse", "id": 1633862304835022851, "created_at": "2023-03-09 16:08:23+00:00"}
{"text": "Congressional Republicans say they want to cut the deficit, but their plans would increase it by $3 trillion over the next decade.\n\nPresident Biden’s budget will cut the deficit by $3 trillion over the next decade.", "user": "WhiteHouse", "id": 1633663901597331456, "created_at": "2023-03-09 03:00:00+00:00"}
{"text": "President Biden’s budget will fully fund Medicare for another generation without cutting benefits or raising taxes on anybody earning less than $400,000 a year.\n\nMeanwhile, Congressional Republican plans would cut Medicare benefits.", "user": "WhiteHouse", "id": 1633648800475631617, "created_at": "2023-03-09 02:00:00+00:00"}
{"text": "Tomorrow, President Biden will release his 2024 budget and show the American people his vision to invest in America, lower costs for families, strengthen and protect Social Security and Medicare, and reduce the deficit.\n\nRepublicans in Congress should do the same.", "user": "WhiteHouse", "id": 1633618603038867464, "created_at": "2023-03-09 00:00:00+00:00"}
{"text": "This Administration is working with partners in every part of the world to expand economic security for women and girls, defend access to health care, safeguard women’s political participation and human rights, and promote the full participation of women and girls in society.", "user": "WhiteHouse", "id": 1633603502248439808, "created_at": "2023-03-08 23:00:00+00:00"}
{"text": "On International Women’s Day, the Biden-Harris Administration celebrates the accomplishments of women and girls around the world and reaffirms its commitment to ensuring that all people can reach their full potential. https://t.co/iuSvf2ojNU", "user": "WhiteHouse", "id": 1633595958192898048, "created_at": "2023-03-08 22:30:01+00:00"}
{"text": "President Biden’s Inflation Reduction Act gave Medicare the power to negotiate for lower drug prices.\n\nUnder his budget, Medicare will have the power to negotiate on more drugs.\n\nCombined with expanded rebates for excessive price hikes, this will cut the deficit by $200 billion.", "user": "WhiteHouse", "id": 1633588404960231424, "created_at": "2023-03-08 22:00:01+00:00"}
{"text": "President Biden’s budget won’t just extend the life of Medicare – it will also lower costs for seniors.\n\nBy reducing prices for high-cost drugs, the budget will cut seniors’ out-of-pocket costs by billions of dollars.", "user": "WhiteHouse", "id": 1633578965729419264, "created_at": "2023-03-08 21:22:30+00:00"}
{"text": "President Biden’s budget will extend the life of Medicare for the Americans who rely on it, including by making the wealthiest pay more of their fair share – closing loopholes and raising taxes by about 1% on income above $400,000.", "user": "WhiteHouse", "id": 1633558205828845574, "created_at": "2023-03-08 20:00:00+00:00"}
{"text": "Tune in for a briefing with Press Secretary Karine Jean-Pierre. https://t.co/rqeh30teEk", "user": "WhiteHouse", "id": 1633522982571106315, "created_at": "2023-03-08 17:40:03+00:00"}
{"text": "Happy Holi from the Biden-Harris Administration! https://t.co/cOJnlfFmnN", "user": "WhiteHouse", "id": 1633488057017028608, "created_at": "2023-03-08 15:21:16+00:00"}
{"text": "President Biden’s budget will create savings by expanding his Medicare drug negotiation policy from the Inflation Reduction Act to cover more drugs.\n\nThese negotiations, combined with expanded rebates for excessive price hikes, will reduce the deficit by $200 billion.", "user": "WhiteHouse", "id": 1633301514298044416, "created_at": "2023-03-08 03:00:00+00:00"}
{"text": "Since Medicare was passed, income and wealth inequality in the United States have increased dramatically.\n\nBy asking the wealthiest Americans to pay their fair share, President Biden’s budget will keep Medicare strong for decades to come. https://t.co/5WHALxLc6W", "user": "WhiteHouse", "id": 1633286423796170752, "created_at": "2023-03-08 02:00:03+00:00"}
{"text": "This week, President Biden will lay out a budget that invests in America, lowers cost for families, protects and strengthens Social Security and Medicare, and reduces the deficit.\n\nHere’s how he’ll get the job done on Medicare: https://t.co/HwlcWQHpo6", "user": "WhiteHouse", "id": 1633271314269229059, "created_at": "2023-03-08 01:00:00+00:00"}
{"text": "President Biden’s budget will ensure Medicare continues for at least another generation without cutting a single penny in benefits or raising taxes on anybody making less than $400,000 a year. https://t.co/wl13adlEoZ", "user": "WhiteHouse", "id": 1633256223217942528, "created_at": "2023-03-08 00:00:02+00:00"}
{"text": "In 1965, civil rights leaders led peaceful protestors in a march across the Edmund Pettus Bridge, where they were brutally beaten by state troopers. Today, @POTUS reaffirmed his commitment to keep marching – to protect the sacred right to vote in free, fair, and secure elections. https://t.co/ZzZMw2fiJI", "user": "WhiteHouse", "id": 1633248668697645057, "created_at": "2023-03-07 23:30:01+00:00"}
{"text": "Read President Biden’s full op-ed on how his budget will extend Medicare for another generation here: https://t.co/eXHGYsu3Sm https://t.co/2Y0pSY6VlM", "user": "WhiteHouse", "id": 1633242764942127104, "created_at": "2023-03-07 23:06:34+00:00"}
{"text": "Americans pay for their Medicare, going back to their first jobs.\n\nPresident Biden’s budget will extend the life of Medicare for a generation – while lowering costs and without cutting benefits. https://t.co/Tm4kfmb3uT", "user": "WhiteHouse", "id": 1633219077396398081, "created_at": "2023-03-07 21:32:26+00:00"}
{"text": "On the 58th Anniversary of Bloody Sunday, the Biden-Harris Administration honors the legacy of those who marched in Selma and remains committed to protecting the sacred right to vote. https://t.co/j2wqvHS0qe", "user": "WhiteHouse", "id": 1633210927121330177, "created_at": "2023-03-07 21:00:03+00:00"}
{"text": "The right to vote is the threshold of democracy and liberty. https://t.co/TCCaORcnBO", "user": "WhiteHouse", "id": 1633203479228616706, "created_at": "2023-03-07 20:30:27+00:00"}
{"text": "Since their first days in office, President Biden and Vice President Harris have prioritized strengthening our democracy.\n\nRead more about how this Administration is using every tool at its disposal to protect the sacred right to vote: https://t.co/2APxlfEdUD", "user": "WhiteHouse", "id": 1633195818407821312, "created_at": "2023-03-07 20:00:01+00:00"}
{"text": "Tune in for a briefing with Press Secretary Karine Jean-Pierre. https://t.co/N6d2SUvxzK", "user": "WhiteHouse", "id": 1633177229369778179, "created_at": "2023-03-07 18:46:09+00:00"}
{"text": "President Biden’s economic plan is lowering prescription drug, health care, and energy costs for working- and middle-class families – all without raising taxes by a single penny on those earning less than $400,000 a year.", "user": "WhiteHouse", "id": 1632954223523504128, "created_at": "2023-03-07 04:00:00+00:00"}
{"text": "In South Carolina, Vice President Harris announced more than $175 million in funding to expand affordable high-speed internet at 61 HBCUs and Minority Serving Institutions – ensuring students have the access and skills they need to succeed. https://t.co/eIk64dECUV", "user": "WhiteHouse", "id": 1632933557726224385, "created_at": "2023-03-07 02:37:53+00:00"}
{"text": "President Biden’s Inflation Reduction Act finally gave Medicare the power to negotiate lower drug prices and requires rebates to Medicare if prices rise too fast.\n\nThis doesn’t just put money back in seniors’ pockets – it’ll also cut the deficit by $159 billion.", "user": "WhiteHouse", "id": 1632908926248271874, "created_at": "2023-03-07 01:00:00+00:00"}
{"text": "President Biden capped the monthly cost of insulin at $35 for seniors on Medicare.\n\nLast week, Eli Lilly announced they’re lowering prices and capping that cost for everyone else.\n\nIt’s time for Congress and other manufacturers to follow suit. https://t.co/izuM8p2Dyx", "user": "WhiteHouse", "id": 1632893958702374918, "created_at": "2023-03-07 00:00:32+00:00"}
{"text": "Today, President Biden attended the International Association of Fire Fighters Legislative Conference to highlight this Administration’s commitment to investing in firefighters and paramedics and expanding access to resources for them and their families. https://t.co/CigIuxR9G8", "user": "WhiteHouse", "id": 1632887290337939456, "created_at": "2023-03-06 23:34:02+00:00"}
{"text": ".@POTUS signed the Electoral Count Reform Act – which establishes guidelines for our system of certifying and counting electoral votes for President and Vice President.\n\nThis Administration is committed to protecting the sacred right to vote in free, fair, and secure elections.", "user": "WhiteHouse", "id": 1632867402881835009, "created_at": "2023-03-06 22:15:00+00:00"}
{"text": "From Day One, @USDOT has been on the scene in East Palestine assisting in the response to the Norfolk Southern train derailment.\n\nThey’re making critical progress holding the rail industry accountable.  \n https://t.co/m7UZO6rosD", "user": "WhiteHouse", "id": 1632862240394166278, "created_at": "2023-03-06 21:54:29+00:00"}
{"text": "It’s time to pass the Junk Fee Prevention Act and ban airlines from charging families to sit together. https://t.co/2xTWWaID52", "user": "WhiteHouse", "id": 1632833444215390209, "created_at": "2023-03-06 20:00:04+00:00"}
{"text": "Tune in for a briefing with Press Secretary Karine Jean-Pierre. https://t.co/lbCUPIS6UA", "user": "WhiteHouse", "id": 1632815658189611010, "created_at": "2023-03-06 18:49:23+00:00"}
{"text": "President Biden called for airlines to eliminate family seating fees.\n\nAlready, three airlines have changed their policies to eliminate them.\n\nNow, @USDOT is launching a new dashboard to show who is – and is not – charging Americans these hidden junk fees. https://t.co/cvlNPI1w1j", "user": "WhiteHouse", "id": 1632800620997492738, "created_at": "2023-03-06 17:49:38+00:00"}
{"text": "For families like Robin’s, the Affordable Care Act was lifechanging – providing the peace of mind that comes with quality, affordable health care.\n\nIf Republicans in Congress try to take away people’s health care, President Biden will stop them. https://t.co/xwASGPO9eA", "user": "WhiteHouse", "id": 1632747719016980480, "created_at": "2023-03-06 14:19:25+00:00"}
{"text": "Today, President Biden visited Selma, Alabama to commemorate the 58th Anniversary of Bloody Sunday – so that history can’t be erased – and highlight how the continued fight for voting rights is integral to delivering economic justice and civil rights for Black Americans. https://t.co/kIexNAu2dk", "user": "WhiteHouse", "id": 1632562236022575105, "created_at": "2023-03-06 02:02:23+00:00"}
{"text": ".@POTUS is urging Congress to restore the protections of the Voting Rights Act and take additional action by passing the John Lewis Voting Rights Advancement Act and the Freedom to Vote Act. \n \nThis is the only way the nation can fully secure the right to vote in every state.", "user": "WhiteHouse", "id": 1632546538625925120, "created_at": "2023-03-06 01:00:00+00:00"}
{"text": "The nation's reaction to Bloody Sunday helped produce the Voting Rights Act, creating protections against racial discrimination in voting and providing equal access to the ballot.\n \nSince their first days in office, @POTUS and @VP have prioritized protecting this sacred right.", "user": "WhiteHouse", "id": 1632512562766987269, "created_at": "2023-03-05 22:45:00+00:00"}
{"text": "Happening Now: President Biden delivers remarks on the importance of commemorating Bloody Sunday, highlighting how the continued fight for voting rights is integral to delivering economic justice and civil rights for Black Americans. https://t.co/Hzgh2TKqhQ", "user": "WhiteHouse", "id": 1632485043061792770, "created_at": "2023-03-05 20:55:39+00:00"}
{"text": "Under President Biden, companies have announced over $300 billion in private investments in American manufacturing.\n\nHis CHIPS and Science Act is strengthening American supply chains and creating jobs. https://t.co/YjeiiLxTJ7", "user": "WhiteHouse", "id": 1632440844409090052, "created_at": "2023-03-05 18:00:01+00:00"}
{"text": "The national debt took 200 years to accumulate – 25% of this debt was added by the last administration alone. \n\nPresident Biden cut the deficit by $1.7 trillion in just two years, and his budget will cut another $2 trillion over the next ten years.", "user": "WhiteHouse", "id": 1632425743249559552, "created_at": "2023-03-05 17:00:00+00:00"}
{"text": "The Biden-Harris Administration is expanding access to mental health services, including for kids in schools.\n\nPresident Biden is calling on Congress to build on this progress by passing bipartisan legislation to hold Big Tech accountable and protect children online.", "user": "WhiteHouse", "id": 1632410643788709896, "created_at": "2023-03-05 16:00:00+00:00"}
{"text": "As we await the Supreme Court’s decision on this Administration’s one-time student debt relief program, the pause on student loan payments remains in effect.", "user": "WhiteHouse", "id": 1632395541303754753, "created_at": "2023-03-05 15:00:00+00:00"}
{"text": "Thanks to investments from President Biden’s Bipartisan Infrastructure Law, small businesses in every community – urban, rural, suburban, and Tribal – will be connected to affordable high-speed internet access. https://t.co/vnhCmU3OsV", "user": "WhiteHouse", "id": 1632214354476273665, "created_at": "2023-03-05 03:00:01+00:00"}
{"text": "President Biden’s health care initiatives are bringing costs down for families all across America. https://t.co/y50yXUSiZp", "user": "WhiteHouse", "id": 1632169055598657538, "created_at": "2023-03-05 00:00:01+00:00"}
{"text": "Young people are not only the future of Namibia – they are the present. Last week, the First Lady was in Windhoek to speak with young Namibians about the values that we all share: liberty, democracy, and equality. https://t.co/EsxhqruqBa", "user": "WhiteHouse", "id": 1632153973795745794, "created_at": "2023-03-04 23:00:05+00:00"}
{"text": "Across America, tens of thousands of union workers will install 500,000 electric vehicle chargers. \n\nThe Biden-Harris Administration’s infrastructure investments are creating good-paying union jobs while tackling climate change.", "user": "WhiteHouse", "id": 1632138854000984065, "created_at": "2023-03-04 22:00:01+00:00"}
{"text": "It was a busy week at the White House. https://t.co/NcxTPHJVI7", "user": "WhiteHouse", "id": 1632123786014097413, "created_at": "2023-03-04 21:00:08+00:00"}
{"text": "From its first day, the Biden-Harris Administration has focused on helping small businesses recover and grow.\n\nWe’re building on that commitment by ensuring small businesses have the access to the capital, technical assistance, and support they need to thrive.", "user": "WhiteHouse", "id": 1632108654328442884, "created_at": "2023-03-04 20:00:00+00:00"}
{"text": "America is moving forward. https://t.co/PA2MGjrIbx", "user": "WhiteHouse", "id": 1632093605866135552, "created_at": "2023-03-04 19:00:13+00:00"}
{"text": "Insulin costs less than $10 to make, but Americans are sometimes forced to pay over $300 for it.\n\nPresident Biden capped this cost at $35 a month for seniors on Medicare. Now, he’s calling on Congress to cap this cost for every American. https://t.co/zkw4b6D10q", "user": "WhiteHouse", "id": 1632078466790170625, "created_at": "2023-03-04 18:00:03+00:00"}
{"text": "The Biden-Harris economic plan is a blue-collar blueprint – creating good-paying jobs you can raise a family on that don’t require a four-year degree.", "user": "WhiteHouse", "id": 1632048258204815362, "created_at": "2023-03-04 16:00:01+00:00"}
{"text": "President Biden capped insulin costs at $35 a month for seniors on Medicare.\n\nIn his State of the Union, @POTUS called to extend this cap to everyone else.\n\nThis week, Eli Lilly announced that they’re doing just that.", "user": "WhiteHouse", "id": 1632033157682716672, "created_at": "2023-03-04 15:00:01+00:00"}
{"text": "Replacing the 150-year-old Baltimore and Potomac Tunnel in Maryland ➡️ 20,000 new good-paying construction jobs.\n \nThe Biden-Harris Administration’s infrastructure investments are rebuilding America while creating jobs everyone can access. https://t.co/DJPti6QF0K", "user": "WhiteHouse", "id": 1631851970603413504, "created_at": "2023-03-04 03:00:02+00:00"}
{"text": ".@EPA launched a Community Welcome Center in East Palestine – where residents can get their questions answered, schedule cleaning services, and learn more about the ongoing response.\n\nThis Administration has been on the scene since Day One and will stay for as long as it takes. https://t.co/jkNhbugzB4", "user": "WhiteHouse", "id": 1631821763809034240, "created_at": "2023-03-04 01:00:00+00:00"}
{"text": "Over 20,000 new infrastructure projects have already been funded under President Biden. \n\nThis is a once-in-a-generation investment in our nation’s infrastructure that is putting shovels in the ground and cranes in the air across the U.S.", "user": "WhiteHouse", "id": 1631806664490770432, "created_at": "2023-03-04 00:00:00+00:00"}
{"text": "President Biden with Chancellor Scholz to reaffirm the deep bonds of friendship between the United States and Germany. The leaders also discussed their bilateral cooperation on a range of global security and economic issues – including support for Ukraine. https://t.co/CX0eu5N8ne", "user": "WhiteHouse", "id": 1631791572969816065, "created_at": "2023-03-03 23:00:02+00:00"}
{"text": "Today, President Biden awarded the Medal of Honor to Retired U.S. Army Colonel Paris Davis for his remarkable heroism during the Vietnam War. https://t.co/IKWVZjKWLJ", "user": "WhiteHouse", "id": 1631776472082833408, "created_at": "2023-03-03 22:00:02+00:00"}
{"text": "Junk fees are hidden or unfair costs that too many companies – airlines, hotels, ticket sellers – charge consumers.\n\nThe Biden-Harris Administration is taking action to get lots of these fees under control.\n\nWe want to hear about your experiences with junk fees. Share below 👇 https://t.co/SiPiA07wbe", "user": "WhiteHouse", "id": 1631761373251215362, "created_at": "2023-03-03 21:00:02+00:00"}
{"text": "26 million people applied for one-time student debt relief, or were deemed automatically eligible, in the less than 1 month the application was available.\n\nWe’re confident our plan is legal, and we’re going to continue to put the needs of students, borrowers, and families first.", "user": "WhiteHouse", "id": 1631738713687437312, "created_at": "2023-03-03 19:30:00+00:00"}
{"text": "Tune in for a briefing with Press Secretary Karine Jean-Pierre. https://t.co/5iYgZ29beV", "user": "WhiteHouse", "id": 1631719701700124685, "created_at": "2023-03-03 18:14:27+00:00"}
{"text": "Happening Now: President Biden awards the Medal of Honor to Ret. U.S. Army Colonel Paris Davis for his remarkable heroism during the Vietnam War. https://t.co/zIHZW5odPR", "user": "WhiteHouse", "id": 1631696172082446336, "created_at": "2023-03-03 16:40:57+00:00"}
{"text": "MAGA Republicans in Congress have a record – and it includes proposing deep cuts to the Affordable Care Act and Medicaid.\n\nPresident Biden will protect and strengthen these programs. https://t.co/DcUt3d49p7", "user": "WhiteHouse", "id": 1631670822489280514, "created_at": "2023-03-03 15:00:13+00:00"}
{"text": "Thanks to the new prescription drug law signed by President Biden, Medicare will be able to negotiate drug prices and cap out-of-pocket pharmacy costs at $2,000 per year for seniors on Medicare.", "user": "WhiteHouse", "id": 1631504673419980803, "created_at": "2023-03-03 04:00:00+00:00"}
{"text": "12 million new jobs. Unemployment at a more than 50-year low. 800,000 new manufacturing jobs.\n\nPresident Biden’s economic plan is working. https://t.co/bcDlcZA3ir", "user": "WhiteHouse", "id": 1631489579327934464, "created_at": "2023-03-03 03:00:01+00:00"}
{"text": "The Biden-Harris Administration is working to close loopholes in Buy America policies – so materials for roads and bridges, airports, transit, rail, water, high-speed internet, and clean energy infrastructure are made in America and support American jobs.", "user": "WhiteHouse", "id": 1631474474863271936, "created_at": "2023-03-03 02:00:00+00:00"}
{"text": "President Biden applauds the bipartisan group of Senators who are proposing rail safety legislation that provides many of the solutions this Administration has been calling for, including in the wake of the Norfolk Southern train wreck in East Palestine.", "user": "WhiteHouse", "id": 1631464407615111169, "created_at": "2023-03-03 01:20:00+00:00"}
{"text": "This week, in front of the Supreme Court, this Administration forcefully articulated why our one-time student debt relief program is legal and essential to millions of working- and middle-class borrowers most at risk of delinquency or default when the student loan pause ends.", "user": "WhiteHouse", "id": 1631405998169546754, "created_at": "2023-03-02 21:27:54+00:00"}
{"text": "Tune in for a briefing with Press Secretary Karine Jean-Pierre. https://t.co/zdMgJbxL8K", "user": "WhiteHouse", "id": 1631385176277131276, "created_at": "2023-03-02 20:05:10+00:00"}
{"text": "This Administration is investing in small businesses with the State Small Business Credit Initiative – nearly $10 billion to expand access to capital for small businesses, build ecosystems of opportunity and entrepreneurship, and create new jobs and economic opportunity.", "user": "WhiteHouse", "id": 1631353681349074946, "created_at": "2023-03-02 18:00:01+00:00"}
{"text": "Thanks to President Biden’s economic plan, Americans have filed nearly 10.5 million applications to start a small business – making 2021 and 2022 the two best years for small business applications on record. https://t.co/KntrcFogAg", "user": "WhiteHouse", "id": 1631338594672549906, "created_at": "2023-03-02 17:00:04+00:00"}
{"text": "President Biden met with the House Democratic Caucus to discuss how this Administration and Congressional Democrats have made historic progress in building an economy from the bottom up and the middle out. https://t.co/ZXIi6qb3yZ", "user": "WhiteHouse", "id": 1631323491780665348, "created_at": "2023-03-02 16:00:03+00:00"}
{"text": "Congressional Republicans have been trying to undo the Affordable Care Act from the very beginning.\n\nIf they put health insurance on the chopping block to cut taxes for the wealthy, President Biden will fight back. https://t.co/lerfnbJjA2", "user": "WhiteHouse", "id": 1631308385885773824, "created_at": "2023-03-02 15:00:02+00:00"}
{"text": "President Biden is leading a manufacturing boom in America. We’ve seen companies announce over $300 billion in private investment in American manufacturing for the industries of the future.", "user": "WhiteHouse", "id": 1631127185888100352, "created_at": "2023-03-02 03:00:00+00:00"}
{"text": "Instead of paying $100 for the shingles vaccine, seniors with Medicare prescription drug coverage can now get that and other common preventive vaccines for free – thanks to the Inflation Reduction Act.", "user": "WhiteHouse", "id": 1631081885844619266, "created_at": "2023-03-02 00:00:00+00:00"}
{"text": "Happening Now: President Biden delivers remarks at the House Democratic Caucus Issues Conference on his Administration and Congress’ historic investments in America. https://t.co/eT3yx72pjx", "user": "WhiteHouse", "id": 1631075622163185664, "created_at": "2023-03-01 23:35:06+00:00"}
{"text": "If MAGA Congressional Republicans try to take away people’s health care by gutting Medicaid or the Affordable Care Act, President Biden will stop them. https://t.co/FvcBDjGrkv", "user": "WhiteHouse", "id": 1631070565745262595, "created_at": "2023-03-01 23:15:01+00:00"}
{"text": "Congressional Republicans have been trying to undo the Affordable Care Act since it passed 13 years ago and have made repealing it part of virtually every Republican budget since.\n\nThis would take coverage away from millions of Americans, increase costs, and worsen care.", "user": "WhiteHouse", "id": 1631066789277839364, "created_at": "2023-03-01 23:00:00+00:00"}
{"text": "President Biden has nominated Julie Su to serve as Secretary of Labor.\n\nJulie currently serves as the Deputy Secretary of Labor and will continue to build a stronger, more resilient, and more inclusive economy that provides Americans a fair return for their work. https://t.co/Va9NAqoArH", "user": "WhiteHouse", "id": 1631051698335625219, "created_at": "2023-03-01 22:00:03+00:00"}
{"text": "MAGA Congressional Republicans say they want to cut the deficit, but their plans would increase it by $3 trillion.\n\nHow will they make the numbers add up? https://t.co/nGl21BVryp", "user": "WhiteHouse", "id": 1631036599751286786, "created_at": "2023-03-01 21:00:03+00:00"}
{"text": "Tune in for a briefing with Press Secretary Karine Jean-Pierre. https://t.co/mjBbo3JPoV", "user": "WhiteHouse", "id": 1631017289083387908, "created_at": "2023-03-01 19:43:19+00:00"}
{"text": "President Biden has signed into law historic legislation to advance gender equity, including to support women in the workplace and to ensure all people can live free from violence.", "user": "WhiteHouse", "id": 1630985579323179008, "created_at": "2023-03-01 17:37:19+00:00"}
{"text": "Happening Now: President Biden delivers remarks at the Department of Homeland Security’s 20th Anniversary ceremony. https://t.co/8Ar2mIjj76", "user": "WhiteHouse", "id": 1630983645518233616, "created_at": "2023-03-01 17:29:37+00:00"}
{"text": "Leading this Administration’s efforts to advance gender equity is the most diverse group of women at the highest levels of government in U.S. history – including the first female Vice President, Kamala Harris. https://t.co/PBv8Jql4au", "user": "WhiteHouse", "id": 1630972424110915584, "created_at": "2023-03-01 16:45:02+00:00"}
{"text": "The full participation of women is a foundational tenet of democracy. During Women’s History Month, the Biden-Harris Administration celebrates the contributions of women throughout our history and reaffirms our commitment to advancing rights and opportunities for women and girls. https://t.co/XDQLFFGgg7", "user": "WhiteHouse", "id": 1630957581333147648, "created_at": "2023-03-01 15:46:03+00:00"}
{"text": "Happening Now: President Biden delivers remarks on his nomination of Julie Su to serve as the Secretary of Labor. https://t.co/yeesdykRFv", "user": "WhiteHouse", "id": 1630942021459357696, "created_at": "2023-03-01 14:44:14+00:00"}
{"text": "President Biden believes all Americans deserve the peace of mind that comes with quality, affordable health care.\n\nThanks to his leadership, more Americans have health insurance under the Affordable Care Act than ever before.", "user": "WhiteHouse", "id": 1630779899135811585, "created_at": "2023-03-01 04:00:01+00:00"}
{"text": "As Black History Month comes to a close, we honor the vibrancy of Black culture and history that enriches all of American life. https://t.co/G5sGm44ivH", "user": "WhiteHouse", "id": 1630764933284519937, "created_at": "2023-03-01 03:00:32+00:00"}
{"text": "On March 9, President Biden will unveil a budget that grows the economy, invests in the American people, and reduces the deficit. \n\nThat’s in stark contrast to what we’ve seen from Congressional Republicans so far.\n\nWatch as @ShalandaYoung46 explains: https://t.co/d9sRwSXHFO", "user": "WhiteHouse", "id": 1630742283904507909, "created_at": "2023-03-01 01:30:32+00:00"}
{"text": "If MAGA Congressional Republicans cut Medicaid rather than ask billionaires to pay a penny more, nearly 70 million people – most of them seniors, people with disabilities, and children – could lose critical services or their health care altogether.", "user": "WhiteHouse", "id": 1630704399738630144, "created_at": "2023-02-28 23:00:00+00:00"}
{"text": "MAGA Republicans in Congress want to eliminate health coverage for millions of Americans, increase costs for consumers, and make deep cuts to programs that families and seniors depend on – all while giving the wealthiest Americans and big corporations a tax break.", "user": "WhiteHouse", "id": 1630689300462305283, "created_at": "2023-02-28 22:00:00+00:00"}
{"text": "President Biden has taken historic action to lower health care costs for millions of Americans.\n\nHere’s what will happen if Congressional Republicans get their way. https://t.co/OWosfdGTiF", "user": "WhiteHouse", "id": 1630674207821398020, "created_at": "2023-02-28 21:00:02+00:00"}
{"text": "Happening Now: President Biden delivers remarks on his plan to protect Americans’ access to affordable health care and highlight how Congressional Republicans would raise health care costs. https://t.co/o6MUqOa8nc", "user": "WhiteHouse", "id": 1630659547013455900, "created_at": "2023-02-28 20:01:46+00:00"}
{"text": "At @POTUS’ direction, @EPA, @CDCgov, and @FEMA are going door to door in East Palestine to check on families and provide resources. In just 72 hours, they’ve reached 500+ families.\n\nThis Administration has been on the scene since Day One and will stay for as long as it takes.", "user": "WhiteHouse", "id": 1630644002490859539, "created_at": "2023-02-28 19:00:00+00:00"}
{"text": "One in ten Americans has diabetes.\n\nMillions need insulin to control their diabetes, but drug companies charge outrageous prices and make record profits.\n\nPresident Biden’s Inflation Reduction Act capped this cost at $35 a month for seniors on Medicare. https://t.co/kHSyxXkxp9", "user": "WhiteHouse", "id": 1630633744984883210, "created_at": "2023-02-28 18:19:15+00:00"}
{"text": "Building on the U.S. Africa Leaders Summit, the First Lady traveled to Kenya and Namibia to deepen the relationship between America and countries across the continent and honor our shared democratic values. https://t.co/CDRKSfTYZ4", "user": "WhiteHouse", "id": 1630621699099049986, "created_at": "2023-02-28 17:31:23+00:00"}
{"text": "Nearly 90% of the relief of one-time student debt relief will go to borrowers earning less than $75,000 per year.\n\nThis Administration is confident this program is clearly legal and is fighting in court to deliver needed relief to tens of millions of students and borrowers.", "user": "WhiteHouse", "id": 1630600276942913543, "created_at": "2023-02-28 16:06:15+00:00"}
{"text": "Today, this Administration is arguing our case for one-time student debt relief in front of the Supreme Court.\n\nThis relief will help over 40 million borrowers who need a little bit of breathing room as they get back on their feet after the economic crisis caused by the pandemic.", "user": "WhiteHouse", "id": 1630600274841567236, "created_at": "2023-02-28 16:06:15+00:00"}
{"text": "You can now get tax credits to install more energy efficient appliances for your home – helping save money on utility bills while fighting climate change.\n\nLearn more at https://t.co/KTCwt5Tmue.", "user": "WhiteHouse", "id": 1630417508778876930, "created_at": "2023-02-28 04:00:00+00:00"}
{"text": "As of January 1, seniors on Medicare pay no more than $35 a month per insulin prescription.", "user": "WhiteHouse", "id": 1630402411205468160, "created_at": "2023-02-28 03:00:00+00:00"}
{"text": "To celebrate the vibrancy of Black culture and history, President Biden and Vice President Harris hosted a Black History Month reception this evening at the White House. https://t.co/eZn5qxyXnP", "user": "WhiteHouse", "id": 1630391848979116032, "created_at": "2023-02-28 02:18:02+00:00"}
{"text": "Lowering costs for families is a top priority for the Biden-Harris Administration. Here’s a few ways we’re getting it done. https://t.co/vMeMuXJVdp", "user": "WhiteHouse", "id": 1630387319558619137, "created_at": "2023-02-28 02:00:02+00:00"}
{"text": "Efforts to address the train derailment in East Palestine, Ohio continue as this Administration remains on the scene. @EPA, @USDOT, @HHSgov, and @FEMA are focused on holding Norfolk Southern accountable, containing the damage, and monitoring for environmental and health impacts.", "user": "WhiteHouse", "id": 1630384600357675009, "created_at": "2023-02-28 01:49:14+00:00"}
{"text": "As part of President Biden’s Competition Agenda, this Administration accelerated making hearing aids available over the counter. Now, millions of Americans are saving as much as $3,000 per pair.", "user": "WhiteHouse", "id": 1630357112026013697, "created_at": "2023-02-28 00:00:00+00:00"}
{"text": "From locking in savings on health care premiums to making common preventive vaccines free for seniors with Medicare prescription drug coverage, President Biden is bringing down medical costs for millions of Americans. https://t.co/cB7j6fUUw1", "user": "WhiteHouse", "id": 1630349568339484678, "created_at": "2023-02-27 23:30:02+00:00"}
{"text": "President Biden signed legislation to make the wealthy and big corporations pay their fair share.\n\n221 House Republicans voted to repeal this law, help the super-wealthy cheat on their taxes, and add $114 billion to the deficit.", "user": "WhiteHouse", "id": 1630343017549709312, "created_at": "2023-02-27 23:04:00+00:00"}
{"text": "More than 12 million jobs have been created under President Biden’s leadership – helping more families pay their bills and gain economic security. https://t.co/jKLWWNvRRo", "user": "WhiteHouse", "id": 1630338244461096963, "created_at": "2023-02-27 22:45:02+00:00"}
{"text": "Happening Now: President Biden and Vice President Harris deliver remarks at a reception celebrating Black History Month. https://t.co/6fMvwm0TPx", "user": "WhiteHouse", "id": 1630331710012358660, "created_at": "2023-02-27 22:19:04+00:00"}
{"text": "Tune in for a briefing with Press Secretary Karine Jean-Pierre. https://t.co/vL0HvFUsT9", "user": "WhiteHouse", "id": 1630291840942456833, "created_at": "2023-02-27 19:40:38+00:00"}
{"text": "Thanks to President Biden’s Inflation Reduction Act, drug companies now have to pay a rebate to Medicare if they try to raise their prices faster than the rate of inflation.", "user": "WhiteHouse", "id": 1630024922750758912, "created_at": "2023-02-27 02:00:00+00:00"}
{"text": "The Biden-Harris Administration is building a coast-to-coast network of electric vehicle chargers – so the great American road trip can be fully electrified. https://t.co/mk3ljz9smN", "user": "WhiteHouse", "id": 1630006098253037568, "created_at": "2023-02-27 00:45:12+00:00"}
{"text": "Congressional Republicans continue to push legislation to impose a 30% national sales tax on American families – which would raise the debt by trillions and increase the prices of everything from groceries and gas to food and medicine.", "user": "WhiteHouse", "id": 1629994722516189184, "created_at": "2023-02-27 00:00:00+00:00"}
{"text": "The Biden-Harris Administration is modernizing public transit and building jobs along the way. https://t.co/DlWd3QZ5d7", "user": "WhiteHouse", "id": 1629979630248644611, "created_at": "2023-02-26 23:00:02+00:00"}
{"text": "In 2020, 55 of the largest corporations in America paid $0 in federal income tax.\n\nPresident Biden signed legislation to make these companies begin to pay their fair share with a 15% corporate minimum tax.", "user": "WhiteHouse", "id": 1629968298086481920, "created_at": "2023-02-26 22:15:00+00:00"}
{"text": "A week defined by freedom. https://t.co/A4tCdHOkzK", "user": "WhiteHouse", "id": 1629962241796612096, "created_at": "2023-02-26 21:50:56+00:00"}
{"text": "Black members of staff from across the Biden-Harris Administration met with @POTUS and @VP in celebration of Black History Month.\n\nOur Administration is proud to recognize the Black staffers who lead on and are helping create a more fair and inclusive democracy across our nation. https://t.co/FyK1tjr1kA", "user": "WhiteHouse", "id": 1629934340208484354, "created_at": "2023-02-26 20:00:04+00:00"}
{"text": "Republicans in Congress want to extend the Trump tax cuts without paying for them.\n\nThis would add $2.7 trillion to the debt. \n\nAnd it would give Americans making more than $4 million a year an average tax cut of $175,000.", "user": "WhiteHouse", "id": 1629904127361777668, "created_at": "2023-02-26 18:00:00+00:00"}
{"text": "Some seniors used to pay $400 a month for insulin.\n\nThanks to President Biden’s Inflation Reduction Act, that cost is now capped at $35 a month for seniors on Medicare.", "user": "WhiteHouse", "id": 1629873928687480833, "created_at": "2023-02-26 16:00:00+00:00"}
{"text": "Manufacturing is coming back to America under President Biden.\n\n800,000 manufacturing jobs have been created, and private companies have announced more than $300 billion in manufacturing investments here in the United States.", "user": "WhiteHouse", "id": 1629858829583122435, "created_at": "2023-02-26 15:00:00+00:00"}
{"text": "The United States and our allies proudly stand with Ukraine. https://t.co/A6gZFD6Dlw", "user": "WhiteHouse", "id": 1629828634557964291, "created_at": "2023-02-26 13:00:01+00:00"}
{"text": "While the top 1% hides about 20% of their taxable income, working Americans pay 99% of the taxes they owe. \n\nPresident Biden signed legislation to crack down on wealthy tax cheats — but 221 Congressional Republicans voted to repeal this law and add $114 billion to the debt.", "user": "WhiteHouse", "id": 1629662535497424898, "created_at": "2023-02-26 02:00:00+00:00"}
{"text": "The future of American transportation is on track to be cleaner, safer, more affordable, and more reliable than ever — thanks to President Biden’s historic investments in electric vehicles, clean transportation, and batteries. https://t.co/UxAqgeWwlo", "user": "WhiteHouse", "id": 1629632341990596608, "created_at": "2023-02-26 00:00:02+00:00"}
{"text": "Already, the Biden-Harris Administration has funded over 20,000 infrastructure projects across the country — reaching over 4,500 communities across all 50 states and territories.", "user": "WhiteHouse", "id": 1629617236750004228, "created_at": "2023-02-25 23:00:00+00:00"}
{"text": "Because of actions taken by the Biden-Harris Administration, 15 of the 20 largest banks agreed to end bounced check fees — providing families with more breathing room.", "user": "WhiteHouse", "id": 1629602138501312513, "created_at": "2023-02-25 22:00:01+00:00"}
{"text": "The Biden-Harris Administration is proposing to cut credit card late fees by up to 75% – keeping more money in Americans’ pockets. https://t.co/RexvZ2MPcL", "user": "WhiteHouse", "id": 1629572106974380037, "created_at": "2023-02-25 20:00:40+00:00"}
{"text": "President Biden’s Inflation Reduction Act locked in savings on health care premiums for millions of Americans.\n\nNow, Congressional Republicans are trying to repeal this law – which would raise health care costs for 14.5 million Americans.", "user": "WhiteHouse", "id": 1629556838923399170, "created_at": "2023-02-25 19:00:00+00:00"}
{"text": "Seniors used to pay as much as $200 for the shingles vaccine.\n\nNow, thanks to legislation signed by President Biden, common preventive vaccines cost $0 for seniors with Medicare prescription drug coverage.", "user": "WhiteHouse", "id": 1629541736878952449, "created_at": "2023-02-25 18:00:00+00:00"}
{"text": "America is on the move again. https://t.co/Ny7unQEy1H", "user": "WhiteHouse", "id": 1629511542910623744, "created_at": "2023-02-25 16:00:01+00:00"}
{"text": "Across the country, there is strong desire for the Biden-Harris Administration’s one-time student debt relief.\n\nWe are continuing to fight in court to deliver relief to tens of millions of eligible borrowers. https://t.co/1JNvFjatzC", "user": "WhiteHouse", "id": 1629496458259906562, "created_at": "2023-02-25 15:00:04+00:00"}
{"text": "February 24, 2023: One year after the Russian invasion of Ukraine, Kyiv stands free.\n\nWe will continue to work with our allies and partners to stand against Russia’s aggression and provide critical support to the people of Ukraine for as long as it takes.\nhttps://t.co/atkV54MvOS", "user": "WhiteHouse", "id": 1629464754531041281, "created_at": "2023-02-25 12:54:06+00:00"}
{"text": "February 21: President Biden visits Warsaw, Poland to thank President Andrzej Duda and the Polish people for opening their hearts and homes to Ukraine.\n \nFebruary 22: The President meets with the Bucharest Nine nations – NATO Allies at the frontlines of Europe’s defense. https://t.co/WA92kY2pdq", "user": "WhiteHouse", "id": 1629464751146168321, "created_at": "2023-02-25 12:54:05+00:00"}
{"text": "February 20: In a visit to Kyiv, President Biden reaffirms the United States’ unwavering commitment to Ukraine’s democracy, sovereignty, and territorial integrity. https://t.co/0AX9X3Sj7T", "user": "WhiteHouse", "id": 1629464748487069701, "created_at": "2023-02-25 12:54:04+00:00"}
{"text": "December 21: @POTUS meets with @ZelenskyyUa at the White House, after which Zelenskyy addressed a joint session of Congress. @POTUS announces additional security assistance, including a Patriot air defense system, to Ukraine.\nhttps://t.co/ufUn82SWLH", "user": "WhiteHouse", "id": 1629464746310131714, "created_at": "2023-02-25 12:54:04+00:00"}
{"text": "December 11: @POTUS calls @ZelenskyyUa to discuss how the U.S. is helping strengthen Ukraine’s air defenses and support Ukraine’s energy infrastructure in the wake of Russia’s targeted attacks.\n \nAnd discussed the potential for President Zelenskyy to visit Washington.", "user": "WhiteHouse", "id": 1629464744808595460, "created_at": "2023-02-25 12:54:03+00:00"}
{"text": "October 10: In the wake of Russia’s missile strikes on critical infrastructure across Ukraine, @POTUS calls @ZelenskyyUa to express his condolences and reiterate the U.S. commitment to providing Ukraine with support to defend itself, including advanced air defense systems.", "user": "WhiteHouse", "id": 1629464742900187139, "created_at": "2023-02-25 12:54:03+00:00"}
{"text": "August 25: On Ukrainian Independence Day, @POTUS makes it clear the U.S. will support Ukraine’s defense of its sovereignty.\n\nOctober 4: @POTUS and @VP speak with @ZelenskyyUa to underscore that the U.S. will never recognize Russia’s purported annexation of Ukrainian territory. https://t.co/nI7f1MxWYF", "user": "WhiteHouse", "id": 1629464739892936704, "created_at": "2023-02-25 12:54:02+00:00"}
{"text": "July 19: @POTUS and @FLOTUS welcome Ukrainian First Lady Zelenska to the White House to underscore that U.S. support for Ukraine is comprehensive, enduring, and focused on the Ukrainian people.\nhttps://t.co/q8vWOfZsn6", "user": "WhiteHouse", "id": 1629464737661501441, "created_at": "2023-02-25 12:54:02+00:00"}
{"text": "June 1: The Administration authorizes critical security assistance for Ukraine, including High Mobility Artillery Rocket Systems.\n \nJune 30: @POTUS attends a NATO Summit in Madrid, encouraging Allies and partners to continue to make significant contributions to Ukraine’s defense.", "user": "WhiteHouse", "id": 1629464736105414658, "created_at": "2023-02-25 12:54:01+00:00"}
{"text": "April 13: @POTUS announces new security assistance for Ukraine, including new capabilities like artillery systems, artillery rounds, and armored personnel carriers.\n \nMay 8: @POTUS speaks with G7 Leaders about maintaining unity and commitment to support Ukraine.", "user": "WhiteHouse", "id": 1629464734469586944, "created_at": "2023-02-25 12:54:01+00:00"}
{"text": "March 25: @POTUS visits U.S. troops, aid workers, and Ukrainian refugees in Poland for a briefing on humanitarian efforts, and delivers a speech in Warsaw rallying the free world to support Ukraine.\nhttps://t.co/HfvRH7V9Yh", "user": "WhiteHouse", "id": 1629464732762554369, "created_at": "2023-02-25 12:54:00+00:00"}
{"text": "March 15: The first of four aid packages passed by Congress for Ukraine is signed into law. \n\nMarch 24: @POTUS travels to Brussels for an extraordinary summit of NATO leaders. \nhttps://t.co/DK0M2NAMjP", "user": "WhiteHouse", "id": 1629464730887766019, "created_at": "2023-02-25 12:54:00+00:00"}
